In [2]:
import pandas as pd
import numpy as np

# Load data

In [57]:
path= 'TSLA.csv'
with open(path)as file:
    data=pd.read_csv(file,header=0,encoding='UTF-8')
    print("Data Loaded!")
    npdata=data.to_numpy()

Data Loaded!

# TASK1 查找NaN的位置返回并删除NaN所在行

##### 查找位置

In [58]:
# 从内到外依次为：
# 获取除了Data的列——>查找NaN所在的位置——>保留行号信息——>去重——>保存在position中
position = np.unique(np.where(np.isnan(npdata[:,1:].astype(float)))[0])

# 去除了标题行，并且标号从0开始，故转化为原来csv表需要加上2
print("NaN所在行数为")
print(position+2)

NaN所在行数为
[  6   7  13  14  20  21  27  28  34  35  41  42  48  49  55  56  62  63
  69  70  76  77  83  84  90  91  97  98 104 105 111 112 118 119 125 126
 132 133 139 140 146 147 153 154 160 161 167 168 174 175]

#### 删除NaN所在行

In [183]:
del_nan = data.drop(axis=0,index=position)
del_nan

           Date    Price     Open     High      Low
0     2022/4/14   985.00   999.29  1012.71   982.19
1     2022/4/13  1022.37   981.08  1026.24   973.10
2     2022/4/12   986.95   997.64  1021.19   976.60
3     2022/4/11   975.93   980.40  1008.47   974.64
6      2022/4/8  1025.49  1043.21  1048.44  1022.43
...         ...      ...      ...      ...      ...
2531  2012/4/18     6.53     6.42     6.55     6.31
2532  2012/4/18     6.53     6.42     6.55     6.31
2533  2012/4/18     6.53     6.42     6.55     6.31
2534  2012/4/18     6.53     6.42     6.55     6.31
2535  2012/4/17     6.45     6.49     6.61     6.41

[2486 rows x 5 columns]

# TASK2 删除重复的日期数据并打印出删除的行数

In [172]:
# 将npdata用上一问去掉NaN的data frame更新
npdata = del_nan.to_numpy()

In [107]:
# 去重
# Args: unique_date是保留的日期，left_rows是保留的行
unique_date, left_rows = np.unique(npdata[:,0],return_index = True)

In [108]:
count = npdata[:,0].size-left_rows.size
print("删除了{}行".format(count))

删除了8行

In [179]:
# 获取删除的行数
del_rows = []
for i in range(npdata[:,0].size):
    if ((left_rows.__contains__(i))==False):
        del_rows = np.append(del_rows,i).astype(int)
print("有重复数据的行号为：",del_rows)
# 删除重复日期，保存在del_date中
del_date = del_nan.drop(del_rows)
print("删除重复日期成功！")

有重复数据的行号为： [2471 2472 2479 2480 2481 2482 2483 2484]
删除重复日期成功！

# TASK3 涨停跌停计算